# ultra_nano_pose.yaml
task: pose
nc:   1
kpt_shape: [21,3]
scale: "n"

# Backbone (depth=1 everywhere, width×0.5)
backbone:
  - [-1,1,Conv,   [16,3,2]]    # P1/2
  - [-1,1,DWConv, [32,3,2]]    # P2/4
  - [-1,1,ECA,    [32,3]]      
  - [-1,1,C2f,   [32,True]]    # single C2f

  - [-1,1,DWConv, [64,3,2]]    # P3/8
  - [-1,1,CoordAtt,[64]]
  - [-1,1,C2f,   [64,True]]

  - [-1,1,DWConv, [128,3,2]]   # P4/16
  - [-1,1,C2f,   [128,True]]

  - [-1,1,DWConv, [256,3,2]]   # P5/32
  - [-1,1,SPPF,  [256,5]]

# Single-stage BiFPN
head:
  - [[ 2, 5, 8], 1, BiFPN, [64]]  # fuse P2/P3/P4 into 64-ch
  - [-1,1,Conv, [64,1,1]]         # reduce

  # combined Detect+Pose head
  - [-1,1,DetectPose, [nc, kpt_shape]]
