# ultra_nano_detect.yaml
task: detect
nc: 1
scale: "s"

# --------------------------
# Backbone (depth=1 everywhere, width×0.5)
# --------------------------
backbone:
  - [-1, 1, Conv,       [16, 3, 2]]    # P1/2
  - [-1, 1, DWConv,     [32, 3, 2]]    # P2/4
  - [-1, 1, ECA,        [32,   3]]
  - [-1, 1, C2f,        [32, True]]

  - [-1, 1, DWConv,     [64, 3, 2]]    # P3/8
  - [-1, 1, CoordAtt,   [64]]
  - [-1, 1, C2f,        [64, True]]

  - [-1, 1, DWConv,     [128, 3, 2]]   # P4/16
  - [-1, 1, C2f,        [128, True]]

  - [-1, 1, DWConv,     [256, 3, 2]]   # P5/32
  - [-1, 1, SPPF,       [256, 5]]

# --------------------------
# Neck (top-down FPN)
# --------------------------
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  
  - [[-1, 8], 1, Concat, [1]]  
  - [-1, 1, C2f, [128, True]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  
  - [[-1, 6], 1, Concat, [1]]  
  - [-1, 1, C2f, [64, True]]

# --------------------------
# Detect Head
# --------------------------
  - [[16, 13, 10], 1, Detect, [nc]]
