# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv8s configuration with Coordinate Attention and CBAM for real-time index finger angle estimation
# Optimized for hand pose estimation with P2 head for fine-grained finger joint detection

# Parameters
nc: 1  # number of classes (e.g., person with hand keypoints)
kpt_shape: [21, 3]  # number of keypoints (21 for hand, [x, y, confidence])
scale: s  # explicitly set scale to YOLOv8s
scales:  # model compound scaling constants
  n: [0.33, 0.25, 1024]  # YOLOv8n
  s: [0.33, 0.50, 1024]  # YOLOv8s
  m: [0.67, 0.75, 768]   # YOLOv8m
  l: [1.00, 1.00, 512]   # YOLOv8l
  x: [1.00, 1.25, 512]   # YOLOv8x

# Backbone
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 3, 2]]     # 0  → P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 1  → P2/4
  - [-1, 3, C2f, [128, True]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]    # 3  → P3/8
  - [-1, 6, C2f, [256, True]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]    # 5  → P4/16
  - [-1, 6, C2f, [512, True]]     # 6
  - [-1, 1, Conv, [512, 3, 2]]    # 7  → P5/32 (reduced for YOLOv8s)
  - [-1, 3, C2f, [512, True]]     # 8
  - [-1, 1, CoordAtt, [512]]      # 9  (Coordinate Attention, matched to 512 channels)
  - [-1, 1, CBAM, [512]]          # 10 (CBAM, matched to 512 channels)
  - [-1, 1, SPPF, [512, 5]]       # 11

# Head
head:
  # Multi-scale FPN (P3, P4, P5)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12: upsample to P4
  - [[-1, 6], 1, Concat, [1]]                   # 13: concatenate with backbone P4
  - [-1, 3, C2f, [512]]                         # 14
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15: upsample to P3
  - [[-1, 4], 1, Concat, [1]]                   # 16: concatenate with backbone P3
  - [-1, 3, C2f, [256]]                         # 17
  - [-1, 1, Conv, [256, 3, 2]]                  # 18: downsample to P4
  - [[-1, 14], 1, Concat, [1]]                  # 19: concatenate with head P4
  - [-1, 3, C2f, [512]]                         # 20
  - [-1, 1, Conv, [512, 3, 2]]                  # 21: downsample to P5
  - [[-1, 11], 1, Concat, [1]]                  # 22: concatenate with backbone P5
  - [-1, 3, C2f, [512]]                         # 23
  - [[17, 20, 23], 1, Pose, [nc, kpt_shape]]    # 24: Pose head for multi-scale keypoints (P3, P4, P5)

  # P2-only head for fine-grained finger joint detection
  - [2, 1, Conv, [256, 3, 1]]                   # 25: project P2 (128 channels from layer 2) to 256
  - [[-1], 1, Detect, [nc]]                     # 26: Detect head for P2 bounding box detection
  - [-1, 1, Pose, [nc, kpt_shape]]              # 27: Pose head for P2 keypoint detection
