# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 configuration with Coordinate Attention and CBAM
# Custom setup for real-time index-finger angle estimation

# Parameters
nc: 1          # number of classes (e.g., hand/finger)
kpt_shape: [21, 3]  # number of keypoints x [x, y, confidence] (e.g., 21 for hand pose)
scales:
  n: [0.33, 0.25, 1024]  # YOLOv8n
  s: [0.33, 0.50, 1024]  # YOLOv8s
  m: [0.67, 0.75, 768]   # YOLOv8m
  l: [1.00, 1.00, 512]   # YOLOv8l
  x: [1.00, 1.25, 512]   # YOLOv8x

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]     # 0  → P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 1  → P2/4
  - [-1, 3, C2f, [128, True]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]    # 3  → P3/8
  - [-1, 6, C2f, [256, True]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]    # 5  → P4/16
  - [-1, 6, C2f, [512, True]]     # 6
  - [-1, 1, Conv, [1024, 3, 2]]   # 7  → P5/32
  - [-1, 3, C2f, [1024, True]]    # 8
  - [-1, 1, CoordAtt, [1024]]     # 9  (Coordinate Attention)
  - [-1, 1, CBAM, [1024]]         # 10 (CBAM)
  - [-1, 1, SPPF, [1024, 5]]      # 11

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12: up → P4
  - [[-1, 6], 1, Concat, [1]]                   # 13: cat with backbone P4
  - [-1, 3, C2f, [512]]                         # 14
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15: up → P3
  - [[-1, 4], 1, Concat, [1]]                   # 16: cat with backbone P3
  - [-1, 3, C2f, [256]]                         # 17
  - [-1, 1, Conv, [256, 3, 2]]                  # 18: down → P4
  - [[-1, 14], 1, Concat, [1]]                  # 19: cat with head P4
  - [-1, 3, C2f, [512]]                         # 20
  - [-1, 1, Conv, [512, 3, 2]]                  # 21: down → P5
  - [[-1, 11], 1, Concat, [1]]                  # 22: cat with backbone P5
  - [-1, 3, C2f, [1024]]                        # 23

  # Main multi-scale Pose head (P3, P4, P5)
  - [[17, 20, 23], 1, Pose, [nc, kpt_shape]]    # 24

  # P2-only head for fine fingertip/joint features
  - [1, 1, Conv, [256, 1, 1]]                   # 25: project 128→256 on P2
  - [[-1], 1, Pose, [nc, kpt_shape]]            # 26: Pose(P2)
