# hybrid_nano.yaml
task : "pose"
nc: 1
kpt_shape: [21,3]
scale: "n"              # target ~9 GFLOPs

# Backbone: P1→P5 with DWConv + ECA + CoordAtt
backbone:
  - [-1, 1, Conv,     [16, 3, 2]]
  - [-1, 2, DWConv,   [32, 3, 2]]
  - [-1, 1, ECA,      [32, 3]]
  - [-1, 2, C2f,      [32, True]]

  - [-1, 2, DWConv,   [64, 3, 2]]
  - [-1, 1, CoordAtt, [64]]
  - [-1, 2, C2f,      [64, True]]

  - [-1, 2, DWConv,   [128, 3, 2]]
  - [-1, 1, CoordAtt, [128]]
  - [-1, 2, C2f,      [128, True]]

  - [-1, 2, DWConv,   [256, 3, 2]]
  - [-1, 1, ECA,      [256, 3]]
  - [-1, 1, SPPF,     [256, 5]]

# Neck: 2-layer BiFPN
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1,  9], 1, Concat, [1]]
  - [-1, 2, C2f,      [128, True]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1,  6], 1, Concat, [1]]
  - [-1, 2, C2f,      [64, True]]

  - [-1, 1, Conv,     [64, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C2f,      [128, True]]

  - [-1, 1, Conv,     [128, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, C2f,      [256, True]]

  # unified Detect+Pose head on P3,P4,P5
  - [[17, 20, 23], 1, DyHead, [nc, kpt_shape]]
