# ultra_nano_detect_pub_fixed.yaml
task: detect
nc: 1
scale: "s"

# 1) Backbone
backbone:
  - [-1,1, Conv,      [16,3,2]]
  - [-1,1, DWConv,    [32,3,2]]
  - [-1,1, ECA,       [32,3]]
  - [-1,1, C2f,       [32,True]]
  - [-1,1, DWConv,    [64,3,2]]
  - [-1,1, CoordAtt,  [64]]
  - [-1,1, C2f,       [64,True]]
  - [-1,1, DWConv,    [128,3,2]]
  - [-1,1, C2f,       [128,True]]
  - [-1,1, DWConv,    [256,3,2]]
  - [-1,1, SPPF,      [256,5]]

# 2) Dual‑repeat Weighted BiFPN
head:
  - [[6,8,10], 1, BiFPN,       [[64,128,256], 128]]  # first pass
  - [[11,11,11],1, BiFPN,       [[128,128,128],128]]  # feedback pass

  # 3) Dynamic & selective recalibration
  - [-1, 1, DyConv,      [128, 3, 4]]
  - [-1, 1, SKAttention, [128, 2, 4]]

  # 4) Dual Detect heads (both take exactly [nc])
  - [[11], 1, Detect, [nc]]   # P3‑scale head
  - [[12], 1, Detect, [nc]]   # P5‑scale head
