# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# Medical-Optimized Hand Pose Estimation (YOLOv8n) with SimAM + CoordAtt

# ------------------------------------------
# Parameters
# ------------------------------------------
nc: 1                   # single class (hand)
kpt_shape: [4, 3]       # 4 keypoints: [PIP, nail_base, distal_tip, MCP]
scales:                 # Model scaling factors
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
scale: "n"              # YOLOv8n topology

# ------------------------------------------
# Backbone (P1→P5)
# ------------------------------------------
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]     # 0-P1/2 (16ch)
  - [-1, 1, Conv, [32, 3, 2]]     # 1-P2/4
  - [-1, 1, SimAM, []]            # 2-SimAM attention @ P2
  - [-1, 2, C2f, [32, True]]      # 3
  - [-1, 1, Conv, [64, 3, 2]]     # 4-P3/8
  - [-1, 1, CoordAtt, [64]]       # 5-CoordAtt @ P3
  - [-1, 3, C2f, [64, True]]      # 6
  - [-1, 1, Conv, [128, 3, 2]]    # 7-P4/16
  - [-1, 3, C2f, [128, True]]     # 8
  - [-1, 1, Conv, [256, 3, 2]]    # 9-P5/32
  - [-1, 1, SPPF, [256, 5]]       # 10

# ------------------------------------------
# Head (Simplified FPN + Dual Keypoint Heads)
# ------------------------------------------
head:
  # Neck (Lightweight FPN)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 8], 1, Concat, [1]]                   # 12 (P4)
  - [-1, 2, C2f, [128]]                         # 13
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 6], 1, Concat, [1]]                   # 15 (P3)
  - [-1, 2, C2f, [64]]                          # 16
  
  # Primary Pose Head (P3)
  - [[16], 1, Pose, [nc, kpt_shape]]            # 17
  
  # High-Res Aux Head (P2)
  - [3, 1, Conv, [32, 3, 1]]                   # 18
  - [[18], 1, Pose, [nc, kpt_shape]]            # 19
