# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
# Modified for real-time index-finger angle estimation:
#  • nc set to 1
#  • Coordinate Attention + CBAM added
#  • Extra P2-only Detect head appended

# Parameters
nc: 1  # number of classes (hand/finger)
scales:  # model compound scaling constants
  n: [0.33, 0.25, 1024]  # YOLOv8n
  s: [0.33, 0.50, 1024]  # YOLOv8s
  m: [0.67, 0.75, 768]   # YOLOv8m
  l: [1.00, 1.00, 512]   # YOLOv8l
  x: [1.00, 1.25, 512]   # YOLOv8x

# YOLOv8 backbone (with CoordAtt + CBAM)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]  # 8
  - [-1, 1, CoordAtt, [1024]]   # 9 (insert Coordinate Attention)
  - [-1, 1, CBAM, [1024]]       # 10 (insert CBAM)
  - [-1, 1, SPPF, [1024, 5]]    # 11

# YOLOv8 head (with extra P2-only Detect)
# YOLOv8 head (with extra P2-only Detect)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]        # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]        # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]]        # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]       # 21 (P5/32-large)

  # Main multi‐scale Detect (P3, P4, P5)
  - [[15, 18, 21], 1, Detect, [nc]]

  # P2 expansion + Detect
  - [1, 1, Conv, [128, 1, 1]]     # project P2's 128 channels
  - [[-1], 1, Detect, [nc]]       # Detect(P2)

