# Ultra-nano YOLOv8-Pose with BiFPN, C3Ghost, DyHead & MobileViTBlock
# AGPL-3.0 License – https://ultralytics.com/license

task: pose
nc: 1                         # single class (hand)
kpt_shape: [21, 3]           # 21 hand keypoints: x, y, confidence
scale: "n"                   # nano topology (~9 GFLOPs)

# --------------------------
# Backbone (P1 → P5)
# --------------------------
backbone:
  # P1/2
  - [-1, 1, Conv,          [16,   3, 2]]   # stem
  - [-1, 1, DWConv,        [32,   3, 2]]   # lightweight depthwise
  - [-1, 1, ECA,           [32,   3]]      # efficient channel attention
  - [-1, 1, C3Ghost,       [32,   True]]   # ghost-CSP refinement

  # P2/4 → P3/8
  - [-1, 1, DWConv,        [64,   3, 2]]
  - [-1, 1, CoordAtt,      [64]]           # positional attention
  - [-1, 1, C3Ghost,       [64,   True]]

  # P3/8 → P4/16
  - [-1, 1, DWConv,        [128,  3, 2]]
  - [-1, 1, MobileViTBlock,[128,  1, 4]]   # tiny transformer for context
  - [-1, 1, C3Ghost,       [128,  True]]

  # P4/16 → P5/32
  - [-1, 1, DWConv,        [256,  3, 2]]
  - [-1, 1, ECA,           [256,  3]]
  - [-1, 1, SPPF,          [256,  5]]      # spatial pooling

# --------------------------
# Neck + Head
# --------------------------
head:
  # BiFPN fusion of P3, P4, P5 (nodes 6, 9, 12 → all 128-ch → out 64-ch)
  - [[6, 9, 12], 1, BiFPN,       [64]]     

  # Dynamic recalibration
  - [-1,        1, DyHead,       [64]]     

  # Unified Detect+Pose
  - [-1,        1, DetectPose,   [nc, kpt_shape]]

# End of config: ~8.8M params, ~9.2 GFLOPs
