# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# Optimized real-time index-finger pose (YOLOv8s) with streamlined attention and robust P2 keypoint head

# Parameters
nc: 1                   # number of classes (hand/finger)
kpt_shape: [21, 3]     # 21 hand keypoints (x, y, confidence)
scale: "s"             # explicitly select YOLOv8s topology

# Backbone (P1→P5) with mid-level attention at P3 and lightweight pooling at P5
backbone:
  - [-1, 1, Conv,    [32,   3, 2]]   # 0 → P1/2 (32 channels)
  - [-1, 1, Conv,    [64,   3, 2]]   # 1 → P2/4 (64 channels)
  - [-1, 3, C2f,     [64,   True]]   # 2 → feature consistency at 64
  - [-1, 1, Conv,    [128,  3, 2]]   # 3 → P3/8 (128 channels)
  - [-1, 1, CoordAtt,[128]]          # 4 → Coordinate Attention at P3
  - [-1, 6, C2f,     [128,  True]]   # 5 → enriched P3
  - [-1, 1, Conv,    [256,  3, 2]]   # 6 → P4/16 (256 channels)
  - [-1, 6, C2f,     [256,  True]]   # 7 → enriched P4
  - [-1, 1, Conv,    [512,  3, 2]]   # 8 → P5/32 (512 channels)
  - [-1, 1, SPPF,    [512,   5]]     # 9 → spatial pooling at P5

# Head (FPN + Detect) with robust P2 keypoint branch
head:
  # P5 → P4 upsample + concat
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 10
  - [[10, 7], 1, Concat, [1]]                     # 11: merge with P4 features
  - [-1, 3, C2f, [256, True]]                    # 12

  # P4 → P3 upsample + concat
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 13
  - [[13, 5], 1, Concat, [1]]                     # 14: merge with P3 enriched
  - [-1, 3, C2f, [128, True]]                    # 15

  # P3 → P4 downsample + concat
  - [-1, 1, Conv, [128, 3, 2]]                   # 16
  - [[16, 12], 1, Concat, [1]]                    # 17
  - [-1, 3, C2f, [256, True]]                    # 18

  # P4 → P5 downsample + concat
  - [-1, 1, Conv, [256, 3, 2]]                   # 19
  - [[19, 9 ], 1, Concat, [1]]                    # 20
  - [-1, 3, C2f, [512, True]]                    # 21

  # Multi-scale detection heads (P3, P4, P5)
  - [[15, 18, 21], 1, Detect, [nc]]               # 22

  # High-resolution P2 keypoint head with residual bottleneck
  - [2,   1, Conv, [64, 3, 1]]                    # 23: initial P2 projection
  - [-1, 1, nn.ReLU, []]                          # 24: non-linearity
  - [-1, 1, Conv, [64, 3, 1]]                     # 25: refinement
  - [[25], 1, Pose, [nc, kpt_shape]]              # 26: P2-based keypoint regression

# -- End of optimized model configuration --
