# Ultralytics 🚀 AGPL‑3.0 License
# Ultra‑light YOLOv8n‑pose for real‑time hand + index‑finger tracking

nc: 1                    # 1 class: hand
kpt_shape: [5, 3]       # e.g. 5 keypoints on index finger: PIP, DIP, TIP, etc.
scale: "n"              # YOLOv8n

backbone:
  # [from, num, module, args]
  - [-1, 1, Conv,    [32, 3, 2]]    # 0 → P1/2
  - [-1, 1, Conv,    [64, 3, 2]]    # 1 → P2/4
  - [-1, 2, C2f,     [64, True]]    # 2 → refine P2
  - [-1, 1, Conv,    [128, 3, 2]]   # 3 → P3/8
  - [-1, 4, C2f,     [128, True]]   # 4 → refine P3
  - [-1, 1, Conv,    [256, 3, 2]]   # 5 → P4/16
  - [-1, 4, C2f,     [256, True]]   # 6 → refine P4
  - [-1, 1, Conv,    [512, 3, 2]]   # 7 → P5/32
  - [-1, 2, C2f,     [512, True]]   # 8 → refine P5
  - [-1, 1, SPPF,    [512, 5]]      # 9 → pool

head:
  # FPN merging P5→P4→P3
  - [-1, 1, nn.Upsample, [None,2,'nearest']]  #10
  - [[10,6],1, Concat, [1]]                   #11
  - [-1,2, C2f,     [256, True]]              #12

  - [-1, 1, nn.Upsample, [None,2,'nearest']]  #13
  - [[13,4],1, Concat, [1]]                   #14
  - [-1,2, C2f,     [128, True]]              #15

  - [-1, 1, Conv,  [128,3,2]]                 #16
  - [[16,12],1, Concat, [1]]                  #17
  - [-1,2, C2f,     [256, True]]              #18

  - [-1, 1, Conv,  [256,3,2]]                 #19
  - [[19,9],1, Concat, [1]]                   #20
  - [-1,2, C2f,     [512, True]]              #21

  # Detection on P3, P4, P5
  - [[15,18,21],1, Detect, [nc]]              #22

  # **High‑res P2 keypoint head**  
  - [2, 1, Conv,    [64, 3, 1]]               #23
  - [[23],1, Pose,  [nc, kpt_shape]]          #24

  # **Unified Pose head** (global context)
  - [-1,1, Conv,    [128,1,1]]                #25
  - [[25],1, Pose,  [nc, kpt_shape]]          #26
