# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 🚀 AGPL-3.0 License

# Real-time index-finger angle estimation model with CoordAtt + CBAM

# Parameters
nc: 1  # single class (finger joint)
scales:
  n: [0.33, 0.25, 1024]

# Backbone layers (P1→P5)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]   # 0 → P1/2 (64 channels)
  - [-1, 1, Conv, [128, 3, 2]]  # 1 → P2/4 (128 channels)
  - [-1, 3, C2f, [128, True]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3 → P3/8 (256 channels)
  - [-1, 6, C2f, [256, True]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5 → P4/16 (512 channels)
  - [-1, 6, C2f, [512, True]]   # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7 → P5/32 (1024 channels)
  - [-1, 3, C2f, [1024, True]]  # 8
  - [-1, 1, CoordAtt, [1024]]   # 9
  - [-1, 1, CBAM, [1024]]       # 10
  - [-1, 1, SPPF, [1024, 5]]    # 11

# Head
head:
  # P5 → upsample to P4 scale
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 12
  - [[12, 6], 1, Concat, [1]]                    # 13 concat P4 (512) + up P5 (1024→512)
  - [-1, 3, C2f, [512, True]]                    # 14

  # P4 → upsample to P3 scale
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 15
  - [[15, 4], 1, Concat, [1]]                    # 16 concat P3 (256) + up P4 (512→256)
  - [-1, 3, C2f, [256, True]]                    # 17

  # P3 → downsample to P4
  - [-1, 1, Conv, [256, 3, 2]]                   # 18
  - [[18, 14], 1, Concat, [1]]                   # 19 concat P4 skip (512) + down P3 (256→512)
  - [-1, 3, C2f, [512, True]]                    # 20

  # P4 → downsample to P5
  - [-1, 1, Conv, [512, 3, 2]]                   # 21
  - [[21, 11], 1, Concat, [1]]                   # 22 concat P5 skip (1024) + down P4 (512→1024)
  - [-1, 3, C2f, [1024, True]]                   # 23

  # Detect heads
  - [[17, 20, 23], 1, Detect, [nc]]              # 24 P3, P4, P5 multi-scale

# no extra P2 head to avoid channel mismatches
