# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 configuration with Coordinate Attention and CBAM
# Custom setup for real-time index-finger angle estimation

# Parameters
nc: 1          # number of classes (e.g., hand/finger)
kpt_shape: [21, 3]  # number of keypoints x [x, y, confidence] (e.g., 21 for hand pose)
scales:
  n: [0.33, 0.25, 1024]  # YOLOv8n
  s: [0.33, 0.50, 1024]  # YOLOv8s
  m: [0.67, 0.75, 768]   # YOLOv8m
  l: [1.00, 1.00, 512]   # YOLOv8l
  x: [1.00, 1.25, 512]   # YOLOv8x

# Backbone
backbone:
  - [-1, 1, Conv, [16, 3, 2]]     # 0  → P1/2 (64 * 0.25 = 16)
  - [-1, 1, Conv, [32, 3, 2]]     # 1  → P2/4 (128 * 0.25 = 32)
  - [-1, 3, C2f, [32, True]]      # 2
  - [-1, 1, Conv, [64, 3, 2]]     # 3  → P3/8 (256 * 0.25 = 64)
  - [-1, 6, C2f, [64, True]]      # 4
  - [-1, 1, Conv, [128, 3, 2]]    # 5  → P4/16 (512 * 0.25 = 128)
  - [-1, 6, C2f, [128, True]]     # 6
  - [-1, 1, Conv, [256, 3, 2]]    # 7  → P5/32 (1024 * 0.25 = 256)
  - [-1, 3, C2f, [256, True]]     # 8
  - [-1, 1, CoordAtt, [256]]      # 9  (Coordinate Attention)
  - [-1, 1, CBAM, [256]]          # 10 (CBAM)
  - [-1, 1, SPPF, [256, 5]]       # 11

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12: up → P4
  - [[-1, 6], 1, Concat, [1]]                   # 13: cat with backbone P4 (128 channels)
  - [-1, 3, C2f, [128]]                         # 14 (512 * 0.25 = 128)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15: up → P3
  - [[-1, 4], 1, Concat, [1]]                   # 16: cat with backbone P3 (64 channels)
  - [-1, 3, C2f, [64]]                          # 17 (256 * 0.25 = 64)
  - [-1, 1, Conv, [64, 3, 2]]                   # 18: down → P4
  - [[-1, 14], 1, Concat, [1]]                  # 19: cat with head P4 (128 channels)
  - [-1, 3, C2f, [128]]                         # 20 (512 * 0.25 = 128)
  - [-1, 1, Conv, [128, 3, 2]]                  # 21: down → P5
  - [[-1, 11], 1, Concat, [1]]                  # 22: cat with backbone P5 (256 channels)
  - [-1, 3, C2f, [256]]                         # 23 (1024 * 0.25 = 256)

  # Main multi-scale Pose head (P3, P4, P5)
  - [[17, 20, 23], 1, Pose, [nc, kpt_shape]]    # 24
