nc: 1
kpt_shape: [21, 3]
scale: "s"  # Upgrade to YOLOv8s

backbone:
  - [-1, 1, Conv, [64, 3, 2]]         # 0 → P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1 → P2/4
  - [-1, 1, CoordAtt, [128]]          # 2 → Enhanced attention
  - [-1, 2, C2f, [128, True]]         # 3
  - [-1, 1, GhostConv, [256, 3, 2]]   # 4 → P3/8
  - [-1, 1, CoordAtt, [256]]          # 5
  - [-1, 3, C2f, [256, True]]         # 6
  - [-1, 1, GhostConv, [512, 3, 2]]   # 7 → P4/16
  - [-1, 2, C2f, [512, True]]         # 8
  - [-1, 1, GhostConv, [768, 3, 2]]   # 9 → P5/32
  - [-1, 1, SPPF, [768, 5]]           # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 11
  - [[11, 8], 1, Concat, [1]]                   # 12
  - [-1, 2, C2f, [512, True]]                  # 13
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 14
  - [[14, 6], 1, Concat, [1]]                  # 15
  - [-1, 2, C2f, [256, True]]                  # 16
  - [-1, 1, GhostConv, [256, 3, 2]]            # 17
  - [[17, 13], 1, Concat, [1]]                 # 18
  - [-1, 2, C2f, [512, True]]                  # 19
  - [-1, 1, GhostConv, [512, 3, 2]]            # 20
  - [[20, 10], 1, Concat, [1]]                 # 21
  - [-1, 2, C2f, [768, True]]                  # 22
  - [[16, 19, 22], 1, Detect, [nc]]            # 23
  - [[16, 19, 22], 1, Pose, [nc, kpt_shape]]   # 24
