# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# Hybrid-Light YOLOv8s-Pose: GhostConv + Shuffle-inspired modules + CoordAtt + BiFPN + dual keypoint heads

# ------------------------------------------
# Parameters
# ------------------------------------------
nc: 1                   # hand class
kpt_shape: [21,3]      # 21 hand landmarks (x,y,conf)
scale: "s"             # use YOLOv8s topology as base

# ------------------------------------------
# Backbone (P1 → P5)
# ------------------------------------------
backbone:
  # stem
  - [-1, 1, Conv,        [32, 3, 2]]          # 0 → P1/2 (32)
  # efficient feature extractor
  - [-1, 1, GhostConv,   [64, 3, 2]]          # 1 → P2/4 (64)
  - [-1, 1, CoordAtt,    [64]]                # 2 → positional focus
  - [-1, 2, C2f,         [64, True]]          # 3

  - [-1, 1, GhostConv,   [128, 3, 2]]         # 4 → P3/8 (128)
  - [-1, 1, CBAM,        [128]]               # 5 → channel-spatial refinement
  - [-1, 3, C2f,         [128, True]]         # 6

  - [-1, 1, GhostConv,   [256, 3, 2]]         # 7 → P4/16 (256)
  - [-1, 1, CoordAtt,    [256]]               # 8 → long-range spatial
  - [-1, 3, C2f,         [256, True]]         # 9

  - [-1, 1, GhostConv,   [512, 3, 2]]         #10 → P5/32 (512)
  - [-1, 1, SPPF,        [512, 5]]            #11

# ------------------------------------------
# Neck (2-layer BiFPN-style)
# ------------------------------------------
head:
  # --- BiFPN Up-Path ---
  # P5 → P4
  - [-1, 1, nn.Upsample, [None,2,'nearest']]  #12
  - [[12, 9], 1, Concat, [1]]                  #13
  - [-1, 1, C2f,         [256, True]]         #14

  # P4 → P3
  - [-1, 1, nn.Upsample, [None,2,'nearest']]  #15
  - [[15, 6], 1, Concat, [1]]                 #16
  - [-1, 1, C2f,         [128, True]]         #17

  # --- BiFPN Down-Path ---
  # P3 → P4
  - [-1, 1, Conv,        [128, 3, 2]]         #18
  - [[18, 14],1, Concat, [1]]                 #19
  - [-1, 1, C2f,         [256, True]]         #20

  # P4 → P5
  - [-1, 1, Conv,        [256, 3, 2]]         #21
  - [[21, 11],1, Concat, [1]]                 #22
  - [-1, 1, C2f,         [512, True]]         #23

  # ------------------------------------------
  # Detection Head
  # ------------------------------------------
  - [[17, 20, 23], 1, Detect, [nc]]           #24 detect on P3/P4/P5

  # ------------------------------------------
  # Keypoint Heads
  # ------------------------------------------
  # High-res P3 head for fine finger joints
  - [17, 1, Conv,      [128, 1, 1]]           #25
  - [-1, 1, Pose,      [nc, kpt_shape]]       #26

  # Contextual P5 head to reinforce coarse context
  - [23, 1, Conv,      [256, 1, 1]]           #27
  - [-1, 1, nn.ReLU,   []]                    #28
  - [-1, 1, Conv,      [256, 1, 1]]           #29
  - [[29], 1, Pose,    [nc, kpt_shape]]       #30
