# ultra_hand_nano.yaml
# Lightweight hand detector (~5 GFLOPs, ~1.3 M params)
# Backbone → BiFPN neck → Detect head
nc: 1             # 1 class: hand
scale: "n"        # nano (depth=0.33, width=0.25)

# Backbone (P1→P5)
backbone:
  # P1/2
  - [-1, 1, Conv,      [16, 3, 2]]     # 0: stem
  - [-1, 1, DWConv,    [32, 3, 2]]     # 1: P2
  - [-1, 1, CoordAtt,  [32]]           # 2

  # P2→P3
  - [-1, 2, C2f,       [32, True]]     # 3
  - [-1, 1, DWConv,    [64, 3, 2]]     # 4: P3
  - [-1, 1, GhostConv, [64, 3, 1]]     # 5

  # P3→P4
  - [-1, 2, C2f,       [64, True]]     # 6
  - [-1, 1, DWConv,    [128, 3, 2]]    # 7: P4
  - [-1, 1, CoordAtt,  [128]]          # 8

  # P4→P5
  - [-1, 2, C2f,       [128, True]]    # 9
  - [-1, 1, DWConv,    [256, 3, 2]]    #10: P5
  - [-1, 1, SPPF,      [256, 5]]       #11

# Neck: single‑layer BiFPN to fuse P3, P4, P5
head:
  - [[6, 9, 11], 1, BiFPN, [128]]       #12 fuse into 128 channels
  - [-1,         1, C2f,  [128, True]]  #13 refine fused
  - [[13],       1, Detect, [nc]]       #14 final Detect on P3/P4/P5

# end ultra_hand_nano.yaml
