# YOLOv8s-Pose Enhanced (Optimal for Finger Angles)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]     # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 1-P2/4
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, CBAM, [128]]           # 3  ✅ Spatial detail enhancement
  - [-1, 1, Conv, [256, 3, 2]]    # 4-P3/8
  - [-1, 6, C2f, [256, True]]     # 5
  - [-1, 1, CoordAtt, [256]]      # 6  ✅ Semantic-channel fusion
  - [-1, 1, Conv, [512, 3, 2]]    # 7-P4/16
  - [-1, 6, C2f, [512, True]]     # 8
  - [-1, 1, Conv, [512, 3, 2]]    # 9-P5/32
  - [-1, 3, C2f, [512, True]]     # 10
  - [-1, 1, SPPF, [512, 5]]       # 11

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12
  - [[-1, 8], 1, Concat, [1]]                   # 13 → P4
  - [-1, 3, C2f, [512]]                         # 14
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[-1, 5], 1, Concat, [1]]                   # 16 → P3
  - [-1, 3, C2f, [256]]                         # 17
  - [-1, 1, Conv, [256, 3, 2]]                  # 18 → P4
  - [[-1, 14], 1, Concat, [1]]                  # 19
  - [-1, 3, C2f, [512]]                         # 20
  - [-1, 1, Conv, [512, 3, 2]]                  # 21 → P5
  - [[-1, 11], 1, Concat, [1]]                  # 22
  - [-1, 3, C2f, [512]]                         # 23
  - [[17, 20, 23], 1, Pose, [nc, [4, 3]]]       # 24 ✅ Core output

  # P2 High-Resolution Head
  - [3, 1, Conv, [128, 3, 1]]                  # 25
  - [[25], 1, Pose, [nc, [4, 3]]]              # 26 ✅ Innovation point
