# Ultralytics 🚀 AGPL-3.0 License
# Real‑time index‑finger detection (YOLOv8n) with CoordAtt + CBAM

nc: 1                # one class
# (NO scale: “s” here)

# Backbone
backbone:
  - [-1, 1, Conv,    [64,   3, 2]]    # 0: P1/2
  - [-1, 1, Conv,    [128,  3, 2]]    # 1: P2/4
  - [-1, 3, C2f,     [128, True]]     # 2
  - [-1, 1, Conv,    [256,  3, 2]]    # 3: P3/8
  - [-1, 6, C2f,     [256, True]]     # 4
  - [-1, 1, Conv,    [512,  3, 2]]    # 5: P4/16
  - [-1, 6, C2f,     [512, True]]     # 6
  - [-1, 1, Conv,    [1024, 3, 2]]    # 7: P5/32
  - [-1, 3, C2f,     [1024,True]]     # 8
  - [-1, 1, CoordAtt,[1024]]          # 9
  - [-1, 1, CBAM,    [1024]]          # 10
  - [-1, 1, SPPF,    [1024,5]]        # 11

# Head
head:
  - [-1, 1, nn.Upsample, [None,2,'nearest']]  # 12
  - [[12,6],1, Concat, [1]]                   # 13 (P4 skip is at index 6)
  - [-1,3, C2f, [512,True]]                   # 14

  - [-1,1, nn.Upsample, [None,2,'nearest']]   # 15
  - [[15,4],1, Concat, [1]]                   # 16 (P3 skip is at index 4)
  - [-1,3, C2f, [256,True]]                   # 17

  - [-1,1, Conv, [256,3,2]]                   # 18
  - [[18,14],1, Concat, [1]]                  # 19
  - [-1,3, C2f, [512,True]]                   # 20

  - [-1,1, Conv, [512,3,2]]                   # 21
  - [[21,11],1, Concat, [1]]                  # 22
  - [-1,3, C2f, [1024,True]]                  # 23

  - [[17,20,23],1, Detect, [nc]]              # 24
