# Ultralytics Optimized Ultra Nano Detect Model
# Enhanced for real-time hand detection and tracking
# License: AGPL-3.0 (https://ultralytics.com/license)

task: detect
nc: 1
scale: "n"

# Backbone
backbone:
  - [-1, 1, Conv,       [16, 3, 2]]    # P1/2
  - [-1, 1, DWConv,     [32, 3, 2]]    # P2/4
  - [-1, 1, SE,         [32]]          # SE attention
  - [-1, 1, C2f_Ghost,  [32, True]]    # GhostConv-based C2f

  - [-1, 1, DWConv,     [64, 3, 2]]    # P3/8
  - [-1, 1, SE,         [64]]          # SE attention
  - [-1, 1, C2f_Ghost,  [64, True]]

  - [-1, 1, DWConv,     [128, 3, 2]]   # P4/16
  - [-1, 1, C2f_Ghost,  [128, True]]

  - [-1, 1, DWConv,     [256, 3, 2]]   # P5/32
  - [-1, 1, SPPF,       [256, 5]]

# Neck (BiFPN)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # P5 to P4
  - [[-1, 8], 1, Concat, [1]]  
  - [-1, 1, C2f_Ghost, [128, True]]            # P4 output

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # P4 to P3
  - [[-1, 6], 1, Concat, [1]]  
  - [-1, 1, C2f_Ghost, [64, True]]             # P3 output

  - [-1, 1, DWConv, [64, 3, 2]]                # P3 to P4 down
  - [[-1, 13], 1, Concat, [1]]  
  - [-1, 1, C2f_Ghost, [128, True]]            # P4 output (bottom-up)

  - [-1, 1, DWConv, [128, 3, 2]]               # P4 to P5 down
  - [[-1, 10], 1, Concat, [1]]  
  - [-1, 1, C2f_Ghost, [256, True]]            # P5 output (bottom-up)

# Detect Head
  - [[16, 19, 22], 1, Detect, [nc]]
