# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# Maximally enhanced YOLOv8n for real-time hand and index-finger tracking

# ------------------------------------------
# Parameters
# ------------------------------------------
nc: 1                   # number of classes (hand)
kpt_shape: [21, 3]     # 21 hand keypoints: x, y, confidence
scale: "n"             # explicitly select YOLOv8n topology

# ------------------------------------------
# Backbone (P1→P5) with SimAM, SE, Ghost, GhostC2f
# ------------------------------------------
backbone:
  - [-1, 1, GhostConv, [32,   3, 2]]    # 0 → P1/2
  - [-1, 1, GhostConv, [64,   3, 2]]    # 1 → P2/4
  - [-1, 1, SimAM,     [64]]            # 2 → SimAM attention at P2
  - [-1, 2, GhostC2f,  [64,   True]]    # 3 → refined P2 (lightweight)
  - [-1, 1, GhostConv, [128,  3, 2]]    # 4 → P3/8
  - [-1, 1, SE,        [128,  16]]      # 5 → SE attention at P3
  - [-1, 3, GhostC2f,  [128,  True]]    # 6 → refined P3
  - [-1, 1, GhostConv, [256,  3, 2]]    # 7 → P4/16
  - [-1, 2, GhostC2f,  [256,  True]]    # 8 → enriched P4
  - [-1, 1, GhostConv, [384,  3, 2]]    # 9 → P5/32
  - [-1, 1, SPPF,      [384,   5]]      # 10 → spatial pooling at P5

# ------------------------------------------
# Head (FPN + Detect + Pose)
# ------------------------------------------
head:
  - [-1, 1, nn.Upsample, [None,2,'nearest']]  # 11 → upsample P5 to P4
  - [[11,8],1, Concat, [1]]                   # 12 → merge with P4
  - [-1,2, GhostC2f, [256, True]]             # 13

  - [-1,1, nn.Upsample, [None,2,'nearest']]   # 14 → upsample to P3
  - [[14,6],1, Concat, [1]]                   # 15 → merge with P3
  - [-1,2, GhostC2f, [128, True]]             # 16

  - [-1,1, GhostConv, [128,3,2]]              # 17 → downsample P3 → P4
  - [[17,13],1, Concat, [1]]                  # 18
  - [-1,2, GhostC2f, [256, True]]             # 19

  - [-1,1, GhostConv, [256,3,2]]              # 20 → downsample P4 → P5
  - [[20,10],1, Concat, [1]]                  # 21
  - [-1,2, GhostC2f, [384, True]]             # 22

  - [[16,19,22], 1, Detect, [nc]]             # 23: Detection heads

  - [3, 1, GhostConv, [64, 3, 1]]             # 24: P2 keypoint projection
  - [[24], 1, Pose, [nc, kpt_shape]]          # 25: P2 Pose

  - [8, 1, GhostConv, [256, 1, 1]]            # 26: P4 keypoint projection
  - [-1,1, nn.ReLU, []]                       # 27
  - [-1,1, GhostConv, [256,1,1]]              # 28
  - [[28],1, Pose, [nc, kpt_shape]]           # 29: P4 Pose

# End of enhanced and optimized YOLOv8n-pose configuration
