# Ultralytics 🚀 AGPL-3.0 License
# YOLOv8s-pose with enhanced attention for finger angle estimation
# Version: 1.1 (Medical Imaging Optimized)

# Parameters
nc: 1  # single class (hand)
kpt_shape: [4, 3]  # Keypoints: [PIP_joint, nail_base, distal_tip, MCP_joint]
scales:
  s: [0.33, 0.50, 1024]  # Official YOLOv8s scaling

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]     # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 1-P2/4
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, CBAM, [128]]           # 3  CBAM@P2 (128ch)
  - [-1, 1, Conv, [256, 3, 2]]    # 4-P3/8
  - [-1, 6, C2f, [256, True]]     # 5
  - [-1, 1, CoordAtt, [256]]      # 6  CoordAtt@P3 (256ch)
  - [-1, 1, Conv, [512, 3, 2]]    # 7-P4/16
  - [-1, 6, C2f, [512, True]]     # 8
  - [-1, 1, Conv, [512, 3, 2]]    # 9-P5/32
  - [-1, 3, C2f, [512, True]]     # 10
  - [-1, 1, SPPF, [512, 5]]       # 11

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12
  - [[-1, 8], 1, Concat, [1]]                   # 13 -> P4
  - [-1, 3, C2f, [512]]                         # 14
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[-1, 5], 1, Concat, [1]]                   # 16 -> P3
  - [-1, 3, C2f, [256]]                         # 17
  - [-1, 1, Conv, [256, 3, 2]]                  # 18 -> P4
  - [[-1, 14], 1, Concat, [1]]                  # 19
  - [-1, 3, C2f, [512]]                         # 20
  - [-1, 1, Conv, [512, 3, 2]]                  # 21 -> P5
  - [[-1, 11], 1, Concat, [1]]                  # 22
  - [-1, 3, C2f, [512]]                         # 23
  - [[17, 20, 23], 1, Pose, [nc, kpt_shape]]    # 24: P3/P4/P5 outputs

  # P2 High-Resolution Head (Medical Innovation)
  - [3, 1, Conv, [128, 3, 1]]                  # 25: From CBAM@P2
  - [[25], 1, Pose, [nc, kpt_shape]]            # 26: Dedicated finger joint head
