# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# Optimized real-time hand + index-finger pose (YOLOv8n) with multi-attention, SimAM, and Ghost modules

# ------------------------------------------
# Parameters
# ------------------------------------------
nc: 1                   # number of classes (hand)
kpt_shape: [21, 3]     # 21 hand keypoints: x, y, confidence
scale: "n"             # explicitly select YOLOv8n topology for minimal footprint

# ------------------------------------------
# Backbone (P1→P5) with SimAM, SE, Ghost
# ------------------------------------------
backbone:
  - [-1, 1, GhostConv, [32,   3, 2]]   # 0 → P1/2
  - [-1, 1, GhostConv, [64,   3, 2]]   # 1 → P2/4
  - [-1, 1, SimAM,     [64]]           # 2 → SimAM spatial attention at P2
  - [-1, 2, C2f,       [64,   True]]   # 3 → refine P2
  - [-1, 1, GhostConv, [128,  3, 2]]   # 4 → P3/8
  - [-1, 1, SE,        [128,  16]]     # 5 → SE attention at P3
  - [-1, 3, C2f,       [128,  True]]   # 6
  - [-1, 1, GhostConv, [256,  3, 2]]   # 7 → P4/16
  - [-1, 2, C2f,       [256,  True]]   # 8
  - [-1, 1, GhostConv, [384,  3, 2]]   # 9 → P5/32
  - [-1, 1, SPPF,      [384,   5]]     # 10

# ------------------------------------------
# Head (FPN + Detect + Pose)
# ------------------------------------------
head:
  # P5 → P4
  - [-1, 1, nn.Upsample, [None,2,'nearest']]  # 11
  - [[11,8],1, Concat, [1]]                   # 12
  - [-1,2, C2f, [256, True]]                  # 13

  # P4 → P3
  - [-1,1, nn.Upsample, [None,2,'nearest']]   # 14
  - [[14,6],1, Concat, [1]]                   # 15
  - [-1,2, C2f, [128, True]]                  # 16

  # P3 → P4 downsample
  - [-1,1, GhostConv, [128,3,2]]              # 17
  - [[17,13],1, Concat, [1]]                  # 18
  - [-1,2, C2f, [256, True]]                  # 19

  # P4 → P5 downsample
  - [-1,1, GhostConv, [256,3,2]]              # 20
  - [[20,10],1, Concat, [1]]                  # 21
  - [-1,2, C2f, [384, True]]                  # 22

  # Detection heads on P3, P4, P5
  - [[16,19,22], 1, Detect, [nc]]             # 23

  # High-resolution P2 keypoint head
  - [3, 1, Conv, [64, 3, 1]]                   # 24
  - [[24], 1, Pose, [nc, kpt_shape]]          # 25

  # Contextual P4 keypoint head
  - [8, 1, Conv, [256, 1, 1]]                  # 26
  - [-1,1, nn.ReLU, []]                        # 27
  - [-1,1, Conv, [256,1,1]]                    # 28
  - [[28],1, Pose, [nc, kpt_shape]]           # 29

# End of enhanced YOLOv8n-pose configuration
