task: detect
nc: 1
scale: "s"

# Backbone (same ultra‑light with one added SA at P3 & P4)
backbone:
  - [-1,1,Conv,     [16,3,2]]
  - [-1,1,DWConv,   [32,3,2]]
  - [-1,1,ECA,      [32,3]]
  - [-1,1,C2f,      [32,True]]

  - [-1,1,DWConv,   [64,3,2]]
  - [-1,1,CoordAtt, [64]]
  - [-1,1,C2f,      [64,True]]
  - [-1,1,MobileViTBlock,[64,1,2]]   # global context at P3

  - [-1,1,DWConv,   [128,3,2]]
  - [-1,1,MobileViTBlock,[128,1,2]]  # context at P4
  - [-1,1,C2f,      [128,True]]

  - [-1,1,DWConv,   [256,3,2]]
  - [-1,1,SPPF,     [256,5]]

# Neck: single 3‑node BiFPN
head:
  - [[3, 6, 9], 1, BiFPN, [128]]  # fuse P2,P3,P4 →128
  - [[-1,128,64], 1, Conv, [64,1,1]] # reduce to 64

  # Decoupled head
  - [-1,1,Conv, [64,64,3,1]]
  - [-1,1,nn.ReLU, []]
  - [-1,1,Detect, [nc]]   # classification branch
  - [-2,1,Conv, [64,64,3,1]]
  - [-1,1,nn.ReLU, []]
  - [-1,1,Detect, [nc]]   # regression branch
